REQUEST_URL = "https://api.vk.com/method/"
ACCESS_TOKEN = "315b7fffc3cef85faec2e7723495c30d6b26e6d11bbc6a3a6bb58384a8bf853b07f16587335b3853e4fb6"
CSV_FILE = 'files\countries'

SEX = {
    1: 'женский',
    2: 'мужской',
    3: 'не указан'}
RELATION = {
    1: 'не в браке',
    2: 'есть друг/подруга',
    3: 'помолвлен/помолвлена',
    4: 'женат/замужем',
    5: 'всё сложно',
    6: 'в активном поиске',
    7: 'влюблён/влюблена',
    8: 'в гражданском браке',
    0: 'не указано'}
POLITICAL = {
    1: 'коммунистические',
    2: 'социалистические',
    3: 'умеренные',
    4: 'либеральные',
    5: 'консервативные',
    6: 'монархические',
    7: 'ультраконсервативные',
    8: 'индифферентные',
    9: 'либертарианские'}
PEOPLE_MAIN = {
    1: 'ум и креативность',
    2: 'доброта и честность',
    3: 'красота и здоровье',
    4: 'власть и богатство',
    5: 'смелость и упорство',
    6: 'юмор и жизнелюбие',}
LIFE_MAIN = {
    1: 'семья и дети',
    2: 'карьера и деньги',
    3: 'развлечения и отдых',
    4: 'наука и исследования',
    5: 'совершенствование мира',
    6: 'саморазвитие',
    7: 'красота и искусство',
    8: 'слава и влияние'}
SMOKING = {
    1: 'резко негативное',
    2: 'негативное',
    3: 'компромиссное',
    4: 'нейтральное',
    5: 'положительное'}
ALCOHOL = {
    1: 'резко негативное',
    2: 'негативное',
    3: 'компромиссное',
    4: 'нейтральное',
    5: 'положительное'}
